{
  "subjects": {
    "indianFreedomStruggle": {
      "name": "Indian Freedom Struggle",
      "icon": "🇮🇳",
      "color": "#ff6b6b",
      "topics": {
        "preIndependence": {
          "name": "Pre-Independence Era",
          "questions": [
            "What were the main causes of the Indian Rebellion of 1857?",
            "Describe the role of the Indian National Congress in the freedom struggle",
            "Explain the significance of the Partition of Bengal in 1905",
            "What was the impact of World War I on India's freedom movement?"
          ]
        },
        "keyMovements": {
          "name": "Key Movements",
          "questions": [
            "What were the main features of the Non-Cooperation Movement?",
            "Describe the events of the Salt Satyagraha",
            "Explain the Quit India Movement and its consequences",
            "What was the significance of the Swadeshi Movement?"
          ]
        },
        "prominentLeaders": {
          "name": "Prominent Leaders",
          "questions": [
            "Describe Mahatma Gandhi's philosophy of Satyagraha",
            "What was Subhas Chandra Bose's contribution to the freedom struggle?",
            "Explain Jawaharlal Nehru's vision for independent India",
            "What role did Bhagat Singh play in the Indian independence movement?"
          ]
        }
      }
    },
    "artCulture": {
      "name": "Art and Culture",
      "icon": "🎨",
      "color": "#ff9ff3",
      "topics": {
        "indianArchitecture": {
          "name": "Indian Architecture",
          "questions": [
            "Describe the key features of Mughal architecture",
            "What are the distinguishing characteristics of Dravidian architecture?",
            "Explain the significance of temple architecture in ancient India",
            "How did colonial rule influence Indian architecture?"
          ]
        },
        "performingArts": {
          "name": "Performing Arts",
          "questions": [
            "Describe the eight classical dance forms of India",
            "What are the key elements of Indian classical music?",
            "Explain the history and significance of Sanskrit theater",
            "How are folk performing arts different from classical forms?"
          ]
        },
        "visualArts": {
          "name": "Visual Arts",
          "questions": [
            "Describe the evolution of Indian painting styles",
            "What are the key characteristics of Madhubani painting?",
            "Explain the significance of cave paintings at Ajanta and Ellora",
            "How has contemporary Indian art evolved from traditional forms?"
          ]
        }
      }
    },
    "currentAffairs": {
      "name": "Current Affairs",
      "icon": "📰",
      "color": "#54a0ff",
      "topics": {
        "internationalNews": {
          "name": "International News",
          "questions": [
            "What are the current major global environmental concerns?",
            "Describe recent developments in international space exploration",
            "Explain the impact of recent trade agreements on global economy",
            "What are the key issues being discussed in current UN meetings?"
          ]
        },
        "nationalNews": {
          "name": "National News",
          "questions": [
            "What is name of AI app launched by to preserve tribal languages? and which ministry launched it?",
            "Which technology will be used in Census 2027 for geo taggiong all buildings?",
            "What are the recent economic reforms introduced in India?",
            "Describe the current government initiatives for digital India",
            "Explain recent changes in education policy",
            "What are the key infrastructure projects currently underway?"
          ]
        },
        "businessEconomy": {
          "name": "Business & Economy",
          "questions": [
            "What is the current state of India's GDP growth?",
            "Describe recent trends in the Indian stock market",
            "Explain the impact of recent RBI policies on inflation",
            "What are the current challenges facing India's manufacturing sector?"
          ]
        }
      }
    },
    "economics": {
      "name": "Economics",
      "icon": "💹",
      "color": "#1dd1a1",
      "topics": {
        "basicsofEconomics": {
          "name": "Basics of Economics",
          "questions": [
            "What is the difference between microeconomics and macroeconomics?",
            "What do you undrstand by Primary, Secondary and Tertiary sectors of economy? Give examples.",
            "What is law of Supply and Demand? ",
            "How Demand, Supply and Price are related to each other?",
            "Categorise goods into Necessity, Normal, Inferior, Giffen and Veblen goods with examples. And what happens to law of demand in each case? What is their realtion with income?",
            "Categorize goods into Complementary and Substitute goods with examples. And what happens to demand of one when price of other changes?",
            "When does law of demand fails in case of subsitute goods?",
            "What is the difference between Consumption Goods and Capital Goods? Give examples.",
            "Give three step process to identify Capital Goods from Intermediate Goods.",
            "What does investment in Asset and Capital goods lead to? Which one is more important for economic growth?"
          ]
        },
        "nationalIncome": {
          "name": "National Income",
          "questions": [
            "What are factors of production?",
            "What does the factors of production get in return?",
            "What is the complete process of production?",
            "What are factors of consumption?",
            "What is the circular flow of income?",
            "Wha is GDP? Give its basic outline.",
            "What does domestic economic territory in GDP mean?",
            "What is the expenditure method of calculating GDP?",
            "What is the income method of calculating GDP?",
            "Who calculates GDP in India?",
            "What is the GDP calculation interval in India?",
            "What is current base year for GDP calculation in India?",
            "What is factor cost and market price?",
            "When did the last change in method of GDP calculation happened in India?",
            "How does Nominal GDP differ from Real GDP?",
            "Give basic formula to calculate Real GDP from Nominal GDP.",
            "What is the formula to calculate GDP deflator?",
            "Are imported products included in GDP deflator? Why?",
            "How market price is calculated from factor cost? Give this relation with GDP.",
            "In GDP(Market Price) calculation, Taxes are indirect taxes or direct taxes?",
            "What is the difference between Growth and Development-+?",
            "What are shortcomings of GDP as an indicator of economic growth?",
            "What is GNP? How is it different from GDP? Give Example.",
            "Why India's GNP is negetive",
            "How will you find net GNP from GDP?",
            "What is NFIA? How will you calculate it?",
            "What does it mean when NFIA is negative, positive and equal?",
            "What is ICOR and how is it calculated?",
            "What is the significance of ICOR? What does high and low ICOR indicate?",
            "What is GFCF?",
            "What is productivity with respect to ICOR? and hence for a nation to be productive what should be the ICOR and productivity?",
            "What is marginal productivity and How is it calculated?"
          ]
        },
        "moneyAndBanking": {
          "name": "Money and Banking",
          "questions": [
            "Describe the flow of money in an economy.",
            "What is monetary policy?",
            " What does it mean to have tight and loose monetary policy?And their effects? List terms for stance of monetary policy.",
            "Who formulates monetary policy in India?",
            "How does Supply of money affect inflation and deflation?",
            "What effect does Monetary Policy have on how banks lend money? Give complete process.",
            "What are economic scenarios on which the monetary policy depends? Waht are the impacts of those scenarios on demand, production and consumption?",
            "What steps does RBI take in case of inflation or in case of Economic slowdown?",
            "What is the Law of Diminishing Marginal Utility of Money?",
            "What effect does it have when the currency is Strong or Weak?"
          ]
        },
        "microeconomics": {
          "name": "Microeconomics",
          "questions": [
            "Explain the law of demand and its exceptions",
            "What is price elasticity of demand and how is it measured?",
            "Describe the different market structures in microeconomics",
            "How do firms determine their optimal output level?"
          ]
        },
        "macroeconomics": {
          "name": "Macroeconomics",
          "questions": [
            "What are the components of GDP and how are they calculated?",
            "Explain the Phillips Curve and its implications",
            "Describe the tools of monetary policy used by central banks",
            "What is fiscal policy and how does it affect the economy?"
          ]
        },
        "indianEconomy": {
          "name": "Indian Economy",
          "questions": [
            "Describe the structure of India's GDP by sector",
            "What are the major challenges facing Indian agriculture?",
            "Explain the impact of GST on the Indian economy",
            "What are the key initiatives under 'Make in India'?"
          ]
        }
      }
    },
    "polity": {
      "name": "Polity",
      "icon": "🏛️",
      "color": "#f368e0",
      "topics": {
        "historicalBackground": {
          "name": "Historical Background",
          "questions": [
            "what was the first step taken by the British to establish their control on East India Company? and when?",
            "What were the two main provisions of the Regulating Act of 1773?",
            "When was the Supreme Court of Calcutta established with how many judges?",
            "What was the other name of Act of 1781?",
            "How Act of 1781 increased the powers of the Governor Generals of Bengal and his council?",
            "According to Act of 1781, what matters were under the jurisdiction of the Supreme Court of Calcutta?",
            "Which act first established system of dual government in India and Who?",
            "How Act of 1784 established the system of dual government for the first time in India?",
            "How many members were there in the council of Governor General as per the Act of 1784?",
            "How many members were there in the Board of Control as per the Act of 1784?",
            "When did Lord Cornwallis became the Governor General of India?",
            "What were the two main demands of Lord Cornwallis from the British Parliament?",
            "How did Act of 1793 change the power dynamics in India?",
            "What happened to commander in chief of the British army in India as per the Act of 1793?",
            "Which act laid down that the members of Board of Control should be paid from the Indian revenues and not from the British revenues?",
            "Which act ended the trade monopoly of the East India Company and when was it passed? To what extenet did it end the monopoly?",
            "When was the Consitutional position of British terriories in India was explicitly and what did it meant?",
            "Which act for the first time allowded the local government in India to impose taxes and they could also punish the offenders?",
            "How Charter Act of 1813 affected the Indian Culture and Education? And what steps were taken in this direction?",
            "Which act led to the formation of Governor General of India?",
            "Who was the first Governor General of India?",
            "What was the effect of Charter Act of 1833 on other governor generals?",
            "What was the effect of the Act of 1833 on the East India Company?",
            "Which act led to the codification of Indian Laws and who was the person responsible for it?",
            "What social reforms were introduced by the Act of 1833?",
            "What changes were made in Charter Act of 1833 regarding europeans?",
            "Which act for the first time introduced local representation in the governance of India and what part of governance they were part of?",
            "How many members were there in the Governor General's council as per the Act of 1853? What was to process enact laws?",
            "Which act introcued the open competition system for the recruitment of civil servants in India and when was it passed?",
            "Which act for the first time introduced the element separation of powers between the executive and legislative functions in India?",
            "How did the Governor General Council expanded over the years?",
            "Which act is also known as the Act for the Good Government of India and what were its main provisions?",
            "What was the doctrine of lapse and what act ended it?",
            "What did the Government of India Act of 1858 do to give control to the British parliament over India?",
            "What was the step taken by the British government to oversee the administration of India from London in 1858?",
            "What were the two main provisions for Seceretary of State for India as per the Government of India Act of 1858?",
            "Which act again initiated the process of decentralization of administration in India which were taken away through Charter Act of 1833 and How?",
            "How did Indian Councils Act of 1861 changed the local governance in India?",
            "What were three main provisions realted to Viceroy as per the Indian Councils Act of 1861?",
            "Which act gave the recognition to portfolio system in India and when was it passed?",
            "What were thre main provisions of Morley Minto Reforms? And when were they passed?",
            "Who was the first Indian to be appointed as a member of the Viceroy's Executive Council and when?",
            "What wa the element of elections introduced by the Indian Councils Act of 1909?",
            "What were the three major reforms introduced by the Government of India Act of 1919 fragment of which are still found in our Governance?",
            "What was the Diarchy in provinces? when and why was it introduced?",
            "Which act led to the creation of High Commmissioner of India in London?",
            "Which act made sure Secretary of State was to be paid from the British revenues and not from the Indian revenues?",
            "Which act led to the establishment of All India Federation and why it never came into existance?",
            "Which act introduced responsible government at the provincial level?",
            "Which act introduced responsible government and what does responsible government mean?",
            "What were the main 3 institutions established as per the Government of India Act of 1935? And when were they established?",
            "WHich act under the british government for the first time gave the communal representation to the minorities, women and labour class?",
            "What replaced dyarchy in provinces and when?",
            "How did the Government of India Act of 1935 affect the powers of the Viceroy and Secratry of State?",
            "When was the bicameral system of legislature expanded to more provinces and which act?",
            "Which prime minister of UK announced the plan for the transfer of power in India?",
            "Under the Indian Independence Act of 1947, Secretary of State power was transferred to whom?"
          ]
        },
        "makingOfConstitution": {
          "name": "Making of the Constitution of India",
          "questions": [
            "Who gave the idea of a Constituent Assembly for India and when?",
            "When was the demand for Constituent Assembly was raised by the Indian National Congress?",
            "What was idea for formation of Constituent Assembly given by Nehru?",
            "When was the Constituent Assembly for India demand was accepted by the British government and what was it named?",
            "When was the first draft proposal for the framing of the constitution was made and by whom?",
            "When was the Constituent Assembly for India was formed and how many members were there in it?",
            "How were the members of the Constituent Assembly for India were elected?",
            "When did the first meeting of the Constituent Assembly for India took place and who was elected as its president and why?",
            "When did the rajendra Prasad elected as the permanent president of the Constituent Assembly for India and who were the vice presidents?",
            "What was Objectives Resolution and who moved it and when? And when was it adopted?",
            "When was the Mountbatten Plan was proposed?",
            "What powers were given to constituent assembly as per the Indian Independence Act of 1947?",
            "How was the chairman ship was divided in the Constituent Assembly for India?",
            "What were the other function performed by the Constituent Assembly for India apart from framing the constitution?",
            "When was the Drafting Committee was formed and who was its chairman?",
            "Who were the seven members of the Drafting Committee?",
            "During Adoption of the Constitution, what provisions were immediately adopted?",
            "How many parts, articles and schedules were there in consitution at the time of its adoption?"
          ]
        },
        "salientFeatures": {
          "name": "Salient Features of the Constitution",
          "questions": [
            "How are three pillars of democracy are established through the constitution and how they are related to each other?",
            "How British Parliamentary sytem is different from Indian Parliamentary system?",
            "What is the other name of Parliamentary form of government?",
            "How Indian judiciary is different from American judiciary?",
            "What features of Indain Constitution are borrowed from Irish Constitution?",
            "What features of Indian Constitution are borrowed from Canadian Constitution?",
            "What features of Indian Constitution are borrowed from Australian Constitution?",
            "What features of Indian Constitution are borrowed from South African Constitution?",
            "What features of Indian Constitution are borrowed from Weimar Constitution of Germany?",
            "What features of Indian Constitution are borrowed from British Constitution?",
            "What features of Indian Constitution are borrowed from U.S. Constitution?",
            "What features of Indian Constitution are borrowed from U.S.S.R Constitution?",
            "What features of Indian Constitution are borrowed from Japanese Constitution?",
            "What features of Indian Constitution are borrowed from French Constitution?",
            "What features of Indian Constitution are borrowed from Government of India Act of 1935?"
          ]
        },
        "preamble": {
          "name": "Preamble",
          "questions": [
            "What does the Preamble of the Constitution reflect?",
            "When was it amended and what was amended?",
            "What is meaning of word 'Sovereign' in the Preamble?",
            "What is meaning of word 'Socialist' in the Preamble? And when was it added?",
            "How indian socialism is different from the socialism of other countries? And what is it called?",
            "What is the inspiration of Indian Socialism?",
            "What is meaning of word Secular in the Preamble? How is it different from the western concept of secularism?",
            "In what session congress party adopted the resolution to establish a'socialistic pattern of society' in India?",
            "What is doctrine of popular sovereignty and how it calls into the activity the intelligence and character of ordinary man and woman?",
            "What is direct democracy? What are its four devices? Where it is exercised ?",
            "What is the meaning of 'Referendum' in direct democracy?",
            "What is the meaning of 'Initiative' in direct democracy?",
            "What is the meaning of 'Recall' in direct democracy?",
            "What is the meaning of 'Plebiscite' in direct democracy?",
            "What is Indirect democracy?",
            "What is union of trinity?",
            "What is the meaning of 'Republic' in the Preamble?",
            "What are two most important features of republic?",
            "What is the meaning of 'Democratic' in the Preamble?",
            "What is the meaning of 'Justice' in the Preamble? What are its three dimensions?",
            "What is the meaning of 'Liberty' in the Preamble? What are its two dimensions?",
            "What is the meaning of 'Equality' in the Preamble? What are its three dimensions?",
            "What is the meaning of 'Fraternity' in the Preamble? What are its two dimensions?",
            "Which Supreme Court case declared the Preamble as not a part of the Constitution but a key to open its mind?",
            "Which Supreme Court case declared the Preamble as a part of the Constitution?",
            "Which Supreme Court case declared that the Preamble is the soul of the Constitution?",
            "Which part of constitution was independently enacted by the Constituent Assembly?",
            "How preamble is different from the other parts of the constitution?",
            "How preamble is related to powers of legislature?",
            "Is preamble justiciable?"
          ]
        },
        "unionAndItsTerritory": {
          "name": "Union and its Territory",
          "questions": [
            "What does Article 1 of the Constitution state?",
            "What are two reasons for which India is called a 'Union of States' not 'Federation of States'?",
            "Under which article of the constitution the territory of India is defined? and what does it include?",
            "What is given in the First Schedule of the Constitution?",
            "What are two powers given to the Parliament regarding the admission or establishment of new states in India and under which article?",
            "What does the article 3 of the constitution state?",
            "What are the steps involved in the formation or alteration of states in India?",
            "What is the role of concerned state in the formation or alteration of states in India?",
            "What does Article 4 of the constitution state?",
            "Which article is exempted from the procedure of amendment under article 368?",
            "Which commision first recommended the formation of states on linguistic basis and when?",
            "What were the recommendations of Dhar Commission regarding the formation of states on linguistic basis?",
            "Which was the first state to be formed on linguistic basis and when?",
            "Which state was formed as a result of the demand for a separate Dravidian state?",
            "When was the States Reorganisation Act passed and what did it do?"
          ]
        },
        "citizenship": {
          "name": "Citizenship",
          "questions": [
            "What are the different ways in which a person can acquire Indian citizenship?",
            "What are the rights and duties of Indian citizens as per the Constitution?",
            "How can Indian citizenship be terminated or revoked?",
            "What is the significance of the Citizenship Amendment Act, 2019?"
          ]
        },
        "fundamentalRights": {
          "name": "Fundamental Rights",
          "questions": [
            "What are the six fundamental rights guaranteed by the Indian Constitution?",
            "Explain the significance of the Right to Equality (Articles 14-18)",
            "Describe the Right to Freedom (Articles 19-22) and its limitations",
            "What is the Right against Exploitation (Articles 23-24) and how does it protect citizens?",
            "Explain the Right to Freedom of Religion (Articles 25-28)",
            "What is the Cultural and Educational Rights (Articles 29-30) and who does it protect?",
            "Describe the Right to Constitutional Remedies (Article 32) and its importance",
            "What are the exceptions to the fundamental rights in India?"
          ]
        },
        "governance": {
          "name": "Governance",
          "questions": [
            "What are the key features of the Panchayati Raj system?",
            "Describe the role of the Central Vigilance Commission",
            "Explain the significance of the Right to Information Act",
            "What are the recent reforms in Indian governance?"
          ]
        }
      }
    },
    "accountingAuditing": {
      "name": "Accounting and Auditing",
      "icon": "📊",
      "color": "#ff9f43",
      "topics": {
        "financialAccounting": {
          "name": "Financial Accounting",
          "questions": [
            "Explain the accounting equation and its components",
            "What are the generally accepted accounting principles (GAAP)?",
            "Describe the process of preparing financial statements",
            "How are assets valued and depreciated in accounting?"
          ]
        },
        "auditingStandards": {
          "name": "Auditing Standards",
          "questions": [
            "What are the generally accepted auditing standards (GAAS)?",
            "Describe the different types of audit opinions",
            "Explain the auditor's responsibility for detecting fraud",
            "What is the process of internal control evaluation?"
          ]
        },
        "corporateAccounting": {
          "name": "Corporate Accounting",
          "questions": [
            "How are corporate financial statements different from other entities?",
            "Describe the process of merger and acquisition accounting",
            "Explain the concept of goodwill and its accounting treatment",
            "What are the accounting requirements for public companies?"
          ]
        }
      }
    },
    "computerApplications": {
      "name": "Computer Applications",
      "icon": "💻",
      "color": "#0abde3",
      "topics": {
        "softwareApplications": {
          "name": "Software Applications",
          "questions": [
            "Describe the different types of application software",
            "What are the key features of office productivity suites?",
            "Explain the difference between proprietary and open source software",
            "How do database management systems work?"
          ]
        },
        "webTechnologies": {
          "name": "Web Technologies",
          "questions": [
            "What are the main components of web development?",
            "Describe the difference between front-end and back-end development",
            "Explain how responsive web design works",
            "What are the current trends in web technologies?"
          ]
        },
        "mobileApplications": {
          "name": "Mobile Applications",
          "questions": [
            "What are the different approaches to mobile app development?",
            "Describe the app development lifecycle",
            "Explain the difference between native and hybrid apps",
            "What are the key considerations for mobile UI/UX design?"
          ]
        }
      }
    },
    "reasoning": {
      "name": "Reasoning",
      "icon": "🧠",
      "color": "#a55eea",
      "topics": {
        "logicalReasoning": {
          "name": "Logical Reasoning",
          "questions": [
            "Explain the different types of logical fallacies",
            "What are the components of a valid argument?",
            "Describe the process of deductive reasoning",
            "How is inductive reasoning different from deductive reasoning?"
          ]
        },
        "analyticalReasoning": {
          "name": "Analytical Reasoning",
          "questions": [
            "How do you approach solving seating arrangement problems?",
            "Describe strategies for solving blood relation problems",
            "Explain how to solve coding-decoding questions",
            "What are the techniques for solving direction sense problems?"
          ]
        },
        "verbalReasoning": {
          "name": "Verbal Reasoning",
          "questions": [
            "What are the different types of verbal analogies?",
            "Describe strategies for solving sentence completion questions",
            "Explain how to approach critical reasoning questions",
            "What are the common patterns in verbal classification?"
          ]
        }
      }
    },
    "mathematics": {
      "name": "Mathematics",
      "icon": "🧮",
      "color": "#10ac84",
      "topics": {
        "algebra": {
          "name": "Algebra",
          "questions": [
            "Solve for x: 2x + 5 = 15",
            "Factor the expression: x² - 4",
            "Simplify: (3x²y)(4xy³)",
            "Solve the system: 2x + y = 7, x - y = -1"
          ]
        },
        "geometry": {
          "name": "Geometry",
          "questions": [
            "Calculate the area of a circle with radius 5",
            "Find the volume of a cylinder with radius 3 and height 8",
            "Prove the Pythagorean theorem",
            "Calculate the angles of a triangle with sides 3, 4, 5"
          ]
        },
        "calculus": {
          "name": "Calculus",
          "questions": [
            "Find the derivative of f(x) = 3x² + 2x - 5",
            "Calculate the integral of ∫(2x + 3) dx",
            "Find the limit as x approaches 0 of (sin x)/x",
            "Solve the differential equation: dy/dx = 2y"
          ]
        }
      }
    },
    "labourLaws": {
      "name": "Labour Laws, Industrial Relations and Social Security",
      "icon": "⚖️",
      "color": "#ee5253",
      "topics": {
        "labourLegislation": {
          "name": "Labour Legislation",
          "questions": [
            "What are the key provisions of the Industrial Disputes Act?",
            "Describe the minimum wage laws in India",
            "Explain the provisions of the Factories Act regarding working hours",
            "What are the rights of workers under the Trade Unions Act?"
          ]
        },
        "industrialRelations": {
          "name": "Industrial Relations",
          "questions": [
            "What are the causes of industrial disputes?",
            "Describe the process of collective bargaining",
            "Explain the role of conciliation in resolving industrial disputes",
            "What are the different methods of worker participation in management?"
          ]
        },
        "socialSecurity": {
          "name": "Social Security",
          "questions": [
            "Describe the social security schemes available for organized sector workers",
            "What are the benefits provided under the Employees' Provident Fund scheme?",
            "Explain the provisions of the Employees' State Insurance Act",
            "What social security measures exist for unorganized sector workers?"
          ]
        }
      }
    },
    "science": {
      "name": "Science",
      "icon": "🔬",
      "color": "#66bb6a",
      "topics": {
        "physics": {
          "name": "Physics",
          "questions": [
            "State Newton's three laws of motion",
            "Calculate the force needed to accelerate a 5kg object at 3m/s²",
            "Explain the difference between kinetic and potential energy",
            "Describe the photoelectric effect"
          ]
        },
        "chemistry": {
          "name": "Chemistry",
          "questions": [
            "Balance the equation: H₂ + O₂ → H₂O",
            "Explain the difference between ionic and covalent bonds",
            "Describe the process of electrolysis",
            "What is the pH of a 0.01M HCl solution?"
          ]
        },
        "biology": {
          "name": "Biology",
          "questions": [
            "Explain the process of photosynthesis",
            "Describe the structure of DNA",
            "What is the difference between mitosis and meiosis?",
            "Explain how enzymes work as biological catalysts"
          ]
        }
      }
    }
  }
}
