{
  "subjects": {
    "indianFreedomStruggle": {
      "name": "Indian Freedom Struggle",
      "icon": "🇮🇳",
      "color": "#ff6b6b",
      "topics": {}
    },
    "artCulture": {
      "name": "Art and Culture",
      "icon": "🎨",
      "color": "#ff9ff3",
      "topics": {}
    },
    "currentAffairs": {
      "name": "Current Affairs",
      "icon": "📰",
      "color": "#54a0ff",
      "topics": {
        "news": {
          "name": "News",
          "questions": [
            "What is the name of the AI app launched to preserve tribal languages? and which ministry launched it?",
            "Which technology will be used in Census 2027 for geo-tagging all buildings?",
            "What are the recent economic reforms introduced in India?"
          ]
        }
      }
    },
    "economics": {
      "name": "Economics",
      "icon": "💹",
      "color": "#1dd1a1",
      "topics": {
        "basicsOfEconomics": {
          "name": "Basics of Economics",
          "questions": [
            "What is the difference between microeconomics and macroeconomics?",
            "What do you understand by Primary, Secondary and Tertiary sectors of economy? Give examples.",
            "What is law of Supply and Demand? ",
            "How Demand, Supply and Price are related to each other?",
            "Categorize goods into Necessity, Normal, Inferior, Giffen and Veblen goods with examples. What happens to the law of demand in each case? What is their relation with income?",
            "Categorize goods into Complementary and Substitute goods with examples. What happens to demand of one when the price of the other changes?",
            "When does the law of demand fail in case of substitute goods?",
            "What is the difference between Consumption Goods and Capital Goods? Give examples.",
            "Give three step process to identify Capital Goods from Intermediate Goods.",
            "What does investment in assets and capital goods lead to? Which one is more important for economic growth?"
          ]
        },
        "nationalIncome": {
          "name": "National Income",
          "questions": [
            "What are factors of production?",
            "What does the factors of production get in return?",
            "What is the complete production process?",
            "What are the factors of consumption?",
            "What is the circular flow of income?",
            "What is GDP? Give its basic outline.",
            "What does domestic economic territory mean in GDP?",
            "What is the expenditure method of calculating GDP?",
            "What is the income method of calculating GDP?",
            "Who calculates GDP in India?",
            "What is the GDP calculation interval in India?",
            "What is current base year for GDP calculation in India?",
            "What is factor cost and market price?",
            "When did the last change in method of GDP calculation happened in India?",
            "How does Nominal GDP differ from Real GDP?",
            "Give basic formula to calculate Real GDP from Nominal GDP.",
            "What is the formula to calculate GDP deflator?",
            "Are imported products included in the GDP deflator? Why?",
            "How market price is calculated from factor cost? Give this relation with GDP.",
            "In GDP(Market Price) calculation, Taxes are indirect taxes or direct taxes?",
            "What is the difference between growth and development?",
            "What are the shortcomings of GDP as an indicator of economic growth?",
            "What is GNP? How is it different from GDP? Give Example.",
            "Why is India's GNP negative?",
            "How do you calculate net GNP from GDP?",
            "What is NFIA? How will you calculate it?",
            "What does it mean when NFIA is negative, positive, or equal to zero?",
            "What is ICOR and how is it calculated?",
            "What is the significance of ICOR? What does high and low ICOR indicate?",
            "What is GFCF?",
            "What is productivity with respect to ICOR? and hence for a nation to be productive what should be the ICOR and productivity?",
            "What is marginal productivity and how is it calculated?"
          ]
        },
        "money": {
          "name": "Money",
          "questions": [
            "Describe the flow of money in an economy.",
            "What is monetary policy?",
            " What does it mean to have tight and loose monetary policy?",
            "What are the effects of tight and loose monetary policy?",
            "List terms for stance of monetary policy.",
            "Who formulates monetary policy in India?",
            "How does Supply of money affect inflation and deflation?",
            "What effect does Monetary Policy have on how banks lend money? Give complete process.",
            "What are economic scenarios on which the monetary policy depends?",
            "What are the impacts of different economic scenarios on demand, production and consumption?",
            "What is the term for the action RBI take in case of inflation or economic slowdown?",
            "What is the Law of Diminishing Marginal Utility of Money?",
            "What effect does it have when the currency is strong or weak?",
            "What are thr three components that make up the total money supply?",
            "What are the different deposits in money supply and their types?",
            "What do you mean by liquidity?",
            "Sort these in terms of liquidity: Currency, Demand Deposits, Time Deposits, Savings Deposits, Treasury Bills, Commercial Papers, Bonds, Stocks, Gold, Real Estate.",
            "How liquidity is related to money supply?",
            "How money supply and liquidity will change if Fixed Deposits(PO) are converted to Demand Deposits(Banks)?",
            "How money supply and liquidity will change if Demand Deposits(Banks) are converted to Cash Withdrawal?",
            "Determine if following transactions will be assets or liabilities for banks: Cash Withdrawal, Cash Deposit, Loan taken, Loan given, Interest paid on loan, Interest received on loan.",
            "What is process named by which banks make money?",
            "How can you increase the money multiplier?",
            "Establish order between these processes 'lending money', 'credit creation', 'deposits', 'banking habits', 'economic growth', 'money multiplier'",
            "What is NDTL? Derive it from deposits and liabilities",
            "What is the definition of Reserve Ratio?",
            "What are the types of Reserve Ratio? Explain each.",
            "Who decides what will be the Reserve Ratio? What is the usual range of each type of Reserve Ratio?",
            "What is the relation between Reserve Ratios, Money SUpply and Interest Rates?",
            "If you are RBI Governor and you want to combat inflation, what steps will you take with respect to Reserve Ratios?",
            "How Money Supply is related to Higher or Lower Interest Rates?",
            "What are the types of Demand Liability and Time Liability?",
            "What is CASA?",
            "What is FDRD?",
            "What are the Aggregates of Money Supply in India?",
            "What do you mean by M0 and what are its components?",
            "What do you mean by M1 and what are its components?",
            "What do you mean by M2 and what are its components?",
            "What do you mean by M3 and what are its components?",
            "What do you mean by M4 and what are its components?",
            "Establish relationship between M0, M1, M2, M3 and M4.",
            "Which aggregate of money supply is also called Narrow Money and which one is called Broad Money?",
            "Which aggregate of money supply is also called Reserve Money or High Powered Money?",
            "Arrange aggregates of Money Supply in order of their liquidity.",
            "Which aggregate of money supply is used to measure liquidity in the economy?",
            "Which aggregate of money supply is used to measure inflation in the economy?",
            "Which aggregate of money supply is used to measure savings in the economy?",
            "Which aggregate of money supply is used to measure money in circulation in the economy?",
            "Which aggregate of money supply is used to measure money held by public in the economy?",
            "Which aggregate of money supply is used to measure money held by banks in the economy?",
            "Which aggregate of money supply is used to measure money held by government in the economy?",
            "What will happen to CRR and SLR if there is increase in Banking Habits?",
            "Why do we take M3 when calculating money multiplier?",
            "Derive the formula of money multiplier.",
            "What are the types of monetary policy tools?",
            "Explain the quantitative tools of monetary policy",
            "Explain the qualitative tools of monetary policy",
            "What is the difference between quantitative and qualitative tools of monetary policy?",
            "What are the four types of qualitative tools of monetary policy?",
            "What are the four types of quantitative tools of monetary policy?",
            "What is CRR and how is it calculated?",
            "Under which act CRR is enforced?",
            "How much interest does RBI pay on CRR?",
            "How does CRR effect money multiplier and loan interest rates?",
            "What is SLR and how is it calculated?",
            "What currencies account for SLR?",
            "Does RBI pay interest on SLR?",
            "Under which act SLR is enforced?",
            "How does SLR effect money multiplier and loan interest rates?",
            "What is the purpose of SLR?",
            "Why RBI is considered as the banker's bank?",
            "What is the LAF?",
            "Define the two components of LAF?",
            "What is the purpose of LAF?",
            "Which investment is considered as the safest?",
            "What is true about the Reverse Repo Rate (Multiple Choice)? a) It is Long Term Rate b) Collateral is not required c) It is used to store excess liquidity d) It is interest paid by banks e) You can keep T-Bills (Government Securities) as collateral f) You can not keep SLR (Security) as collateral",
            "What is true about the Repo Rate (Multiple Choice)? a) It is Short Term Rate b) Collateral is not required c) It is used to inject liquidity d) It is interest paid by RBI e) You can keep SLR (Security) as collateral",
            "What is SDF? How is it different from Reverse Repo Rate?",
            "What is MSF? How is it different from Repo Rate?",
            "What is true about MSF (Multiple Choice)? a) It is Short Term Rate b) Collateral is not required c) Only few banks are eligible d) Interest rates are lower than repo rate e) You can keep SLR (Security) as collateral",
            "To combat inflation and economic slowdown, what changes should be made in CRR, SLR, RR, RRR, SDF, MSF and Bank Rate?",
            "What is Bank Rate? How is it different from Repo Rate?",
            "What is OMO?",
            "How does Money Flow in OMOs? Its impact on MS, Liquidity?",
            "How will RBI use OMOs to combat inflation and economic slowdown?",
            "What is G-SAP? What is its impact on liquidity and money supply?",
            "When G-SAP is conducted? by whom?",
            "What is helicopter money?",
            "What is OP-Twist?",
            "Under OP-Twist, which securities are sold and which are bought?",
            "What is the purpose of OP-Twist?",
            "What happens to the liquidity and MS in each case of OP-Twist",
            "Why does RBI under OP-Twist sell short term securities instead of long term securities?",
            "What is MPC?",
            "What are two purpose of MPC?",
            "Who sets the inflation targets?",
            "What is the normal range of inflation?",
            "Why is it recommended that inflation should remain between 2 to 6 percent?",
            "What happens if the Inflation target is breached by MPC?",
            "How many members are there in MPC and who are they?",
            "Is the target set by government for MPC rigid?",
            "Explain the mechanism of voting in MPC.",
            "What is term of setting the inflation target?",
            "What is the term of MPC formation",
            "MPC is powered by which act? And on which committee recommendations?",
            "What do you understand by legal tender in money?",
            "What is fiat money? How is it different from legal tender?",
            "What is commodity money? Give examples.",
            "What is Fiduciary money? Give examples.",
            "What is Plastic money? Give examples.",
            "Fiat money we use in daily life is guaranteed by whom?",
            "Who is the issuing authority of these currency. a)₹1 Note b)₹100-₹500 Note c)Coins",
            "What is Bank and how is it different from RR CRR?",
            "Arrange these in Decreasing Order. a)RR b)RRR c)MSF Rate d)Bank Rate",
            "What are qualitative tools of Monetary Policy? What are its types.",
            "What is PSL and what is its purpose.",
            "What is Moral Suasion and its purpose?",
            "What is margin requirement?",
            "How margin requirement effect MS?",
            "What is credit rationing?",
            "RBI do not have involvement in which of these schemes a)Credit Rationing b)CRR c)MSF e)MR",
            "What is minimum reserve session is equivalent to?"
          ]
        },
        "banking": {
          "name": "Banking",
          "questions": [
            "What is BFI? Give all of its types and subtypes.", 
            "What is NBFC?",
            "What is AFI? Give examples.",
            "Is SEBI AFI?",
            "What are the types of BFI?",
            "5 features on which each bank is judged?",
            "Why payments banks do not do PSL",
            "Under which act RBI has the powers to regulate banks?",
            "What is minimum reserve ratio?",
            "When was RBI established?",
            "What are the four main functions of RBI?",
            "List 5 reports released by the RBI",
            "What is listed under the schedule II of the RBI Act?",
            "What is Scheduled Commercial Banks? Whats is its criteria?",
            "What are the benefits of being scheduled commercial banks?",
            "When does a bank is called PSBS? Map them on all criteria. Give Examples.",
            "What is required for being a Private Bank? Map them on all criteria. Give Examples.",
            "When does a bank is called a foreign bank? Map them on all criteria.",
            "What is D-SIB? When does a bank is called D-SIB?",
            "List all banks in India that are D-SIB",
            "What are RRBs? What is its ownership structure, statutory status? And map them on all criteria.",
            "What are SFBs? What is its ownership structure, statutory status? And map them on all criteria.",
            "What are Payment Banks? What is its ownership structure, statutory status? And map them on all criteria.",
            "What are Cooperative Banks? What is its ownership structure, statutory status? And map them on all criteria.",
            "What are the types and subtypes of Cooperative Banks?",
            "What are the types of Long Term Cooperative Banks?",
            "What are the types of Short Term Cooperative Banks?",
            "What is PACS? Who regulates them and Why?"
          ]
        }
      }
    },
    "polity": {
      "name": "Polity",
      "icon": "🏛️",
      "color": "#f368e0",
      "topics": {
        "historicalBackground": {
          "name": "Historical Background",
          "questions": [
            "what was the first step taken by the British to establish their control on East India Company? and when?",
            "What were the two main provisions of the Regulating Act of 1773?",
            "When was the Supreme Court of Calcutta established with how many judges?",
            "What was the other name of Act of 1781?",
            "How Act of 1781 increased the powers of the Governor Generals of Bengal and his council?",
            "According to Act of 1781, what matters were under the jurisdiction of the Supreme Court of Calcutta?",
            "Which act first established system of dual government in India and Who?",
            "How Act of 1784 established the system of dual government for the first time in India?",
            "How many members were there in the council of Governor General as per the Act of 1784?",
            "How many members were there in the Board of Control as per the Act of 1784?",
            "When did Lord Cornwallis became the Governor General of India?",
            "What were the two main demands of Lord Cornwallis from the British Parliament?",
            "How did Act of 1793 change the power dynamics in India?",
            "What happened to commander in chief of the British army in India as per the Act of 1793?",
            "Which act laid down that the members of Board of Control should be paid from the Indian revenues and not from the British revenues?",
            "Which act ended the trade monopoly of the East India Company and when was it passed? To what extenet did it end the monopoly?",
            "When was the Constitutional position of British terriories in India was explicitly stated and what did it mean?",
            "Which act for the first time allowed the local government in India to impose taxes and they could also punish the offenders.",
            "How Charter Act of 1813 affected the Indian Culture and Education? And what steps were taken in this direction?",
            "Which act led to the formation of Governor General of India?",
            "Who was the first Governor General of India?",
            "What was the effect of Charter Act of 1833 on other governor generals?",
            "What was the effect of the Act of 1833 on the East India Company?",
            "Which act led to the codification of Indian laws and who was responsible for it?",
            "What social reforms were introduced by the Charter Act of 1833?",
            "What changes were made in Charter Act of 1833 regarding europeans?",
            "Which act for the first time introduced local representation in the governance of India and in which part of governance were they involved?",
            "How many members were there in the Governor General's council as per the Charter Act of 1853? What was the process to enact laws?",
            "Which act introduced the open competition system for the recruitment of civil servants in India and when was it passed?",
            "Which act for the first time introduced the element separation of powers between the executive and legislative functions in India?",
            "How did the Governor General Council expanded over the years?",
            "Which act is also known as the Act for the Good Government of India and what were its main provisions?",
            "What was the doctrine of lapse and what act ended it?",
            "What did the Government of India Act of 1858 do to give control to the British parliament over India?",
            "What was the step taken by the British government to oversee the administration of India from London in 1858?",
            "What were the two main provisions for Secretary of State for India as per the Government of India Act of 1858?",
            "Which act again initiated the process of decentralization of administration in India which were taken away through Charter Act of 1833 and How?",
            "How did Indian Councils Act of 1861 associated Indians with the law making process?",
            "What were three main provisions realted to Viceroy as per the Indian Councils Act of 1861?",
            "Which act gave the recognition to portfolio system in India and when was it passed?",
            "What were the three main provisions of Morley-Minto Reforms? And when were they passed?",
            "Who was the first Indian to be appointed as a member of the Viceroy's Executive Council and when was this appointment made?",
            "What was the element of elections introduced by the Indian Councils Act of 1909?",
            "What were the three major reforms introduced by the Government of India Act of 1919, fragments of which are still found in our governance?",
            "What was Diarchy in provinces? When and why was it introduced?",
            "Which act led to the creation of High Commissioner of India in London?",
            "Which act ensured that the Secretary of State was to be paid from British revenues and not from Indian revenues?",
            "Which act led to the establishment of All India Federation and why it never came into existance?",
            "Which act introduced responsible government at the provincial level?",
            "Which act introduced responsible government and what does responsible government mean?",
            "What were the main 3 institutions established as per the Government of India Act of 1935? And when were they established?",
            "WHich act under the british government for the first time gave the communal representation to the minorities, women and labour class?",
            "What replaced Diarchy in provinces and when?",
            "How did the Government of India Act of 1935 affect the powers of the Viceroy and Secretary of State?",
            "When was the bicameral system of legislature expanded to more provinces and which act?",
            "Which prime minister of UK announced the plan for the transfer of power in India?",
            "Under the Indian Independence Act of 1947, to whom was the Secretary of State's power transferred?"
          ]
        },
        "makingOfConstitution": {
          "name": "Making of the Constitution of India",
          "questions": [
            "Who gave the idea of a Constituent Assembly for India and when?",
            "When was the demand for Constituent Assembly was raised by the Indian National Congress?",
            "What was idea for formation of Constituent Assembly given by Nehru?",
            "When was the Constituent Assembly for India demand was accepted by the British government and what was it named?",
            "When was the first draft proposal for the framing of the constitution was made and by whom?",
            "When was the Constituent Assembly for India was formed and how many members were there in it?",
            "How were the members of the Constituent Assembly for India were elected?",
            "When did the first meeting of the Constituent Assembly for India took place and who was elected as its president and why?",
            "When was Rajendra Prasad elected as the permanent president of the Constituent Assembly for India and who were the vice presidents?",
            "What was Objectives Resolution and who moved it and when? And when was it adopted?",
            "When was the Mountbatten Plan was proposed?",
            "What powers were given to the Constituent Assembly as per the Indian Independence Act of 1947?",
            "How was the chairman ship was divided in the Constituent Assembly for India?",
            "What were the other function performed by the Constituent Assembly for India apart from framing the constitution?",
            "When was the Drafting Committee was formed and who was its chairman?",
            "Who were the seven members of the Drafting Committee?",
            "During Adoption of the Constitution, what provisions were immediately adopted?",
            "How many parts, articles and schedules were there in the Constitution at the time of its adoption?"
          ]
        },
        "salientFeatures": {
          "name": "Salient Features of the Constitution",
          "questions": [
            "How are three pillars of democracy are established through the constitution and how they are related to each other?",
            "How British Parliamentary system is different from Indian Parliamentary system?",
            "What is the other name of Parliamentary form of government?",
            "How Indian judiciary is different from American judiciary?",
            "What features of Indian Constitution are borrowed from Irish Constitution?",
            "What features of Indian Constitution are borrowed from Canadian Constitution?",
            "What features of Indian Constitution are borrowed from Australian Constitution?",
            "What features of Indian Constitution are borrowed from South African Constitution?",
            "What features of Indian Constitution are borrowed from Weimar Constitution of Germany?",
            "What features of Indian Constitution are borrowed from British Constitution?",
            "What features of Indian Constitution are borrowed from U.S. Constitution?",
            "What features of Indian Constitution are borrowed from U.S.S.R Constitution?",
            "What features of Indian Constitution are borrowed from Japanese Constitution?",
            "What features of Indian Constitution are borrowed from French Constitution?",
            "What features of Indian Constitution are borrowed from Government of India Act of 1935?"
          ]
        },
        "preamble": {
          "name": "Preamble",
          "questions": [
            "What does the Preamble of the Constitution reflect?",
            "When was it amended and what was amended?",
            "What is meaning of word 'Sovereign' in the Preamble?",
            "What is meaning of word 'Socialist' in the Preamble? And when was it added?",
            "How is Indian socialism is different from the socialism of other countries? And what is it called?",
            "What is the inspiration of Indian Socialism?",
            "What is meaning of word Secular in the Preamble? How is it different from the western concept of secularism?",
            "In what session congress party adopted the resolution to establish a 'socialistic pattern of society' in India?",
            "What is doctrine of popular sovereignty and how it calls into the activity the intelligence and character of ordinary man and woman?",
            "What is direct democracy? What are its four devices? Where is it exercised?",
            "What is the meaning of 'Referendum' in direct democracy?",
            "What is the meaning of 'Initiative' in direct democracy?",
            "What is the meaning of 'Recall' in direct democracy?",
            "What is the meaning of 'Plebiscite' in direct democracy?",
            "What is Indirect democracy?",
            "What is union of trinity?",
            "What is the meaning of 'Republic' in the Preamble?",
            "What are two most important features of republic?",
            "What is the meaning of 'Democratic' in the Preamble?",
            "What is the meaning of 'Justice' in the Preamble? What are its three dimensions?",
            "What is the meaning of 'Liberty' in the Preamble? What are its two dimensions?",
            "What is the meaning of 'Equality' in the Preamble? What are its three dimensions?",
            "What is the meaning of 'Fraternity' in the Preamble? What are its two dimensions?",
            "Which Supreme Court case declared the Preamble as not a part of the Constitution but a key to open its mind?",
            "Which Supreme Court case declared the Preamble as a part of the Constitution?",
            "Which Supreme Court case declared that the Preamble is the soul of the Constitution?",
            "Which part of constitution was independently enacted by the Constituent Assembly?",
            "How preamble is different from the other parts of the constitution?",
            "How preamble is related to powers of legislature?",
            "Is preamble justiciable?"
          ]
        },
        "unionAndItsTerritory": {
          "name": "Union and its Territory",
          "questions": [
            "What does Article 1 of the Constitution state?",
            "What are two reasons for which India is called a 'Union of States' not 'Federation of States'?",
            "Under which article of the constitution the territory of India is defined? and what does it include?",
            "What is given in the First Schedule of the Constitution?",
            "What are two powers given to the Parliament regarding the admission or establishment of new states in India and under which article?",
            "What does the article 3 of the constitution state?",
            "What are the steps involved in the formation or alteration of states in India?",
            "What is the role of concerned state in the formation or alteration of states in India?",
            "What does Article 4 of the constitution state?",
            "Which article is exempted from the procedure of amendment under article 368?",
            "Which commission first recommended the formation of states on linguistic basis and when?",
            "What were the recommendations of Dhar Commission regarding the formation of states on linguistic basis?",
            "Which was the first state to be formed on linguistic basis and when?",
            "Which state was formed as a result of the demand for a separate Dravidian state?",
            "When was the States Re-organization Act passed and what did it do?"
          ]
        },
        "citizenship": {
          "name": "Citizenship",
          "questions": []
        },
        "fundamentalRights": {
          "name": "Fundamental Rights",
          "questions": []
        },
        "governance": {
          "name": "Governance",
          "questions": []
        }
      }
    },
    "accountingAuditing": {
      "name": "Accounting and Auditing",
      "icon": "📊",
      "color": "#ff9f43",
      "topics": {}
    },
    "computerApplications": {
      "name": "Computer Applications",
      "icon": "💻",
      "color": "#0abde3",
      "topics": {
        "basicsOfComputers": {
          "name": "Basics of Computers",
          "questions": [
            "What is MAR?",
            "What is MDR?",
            "What is GPR",
            "What is EPROM",
            "What is EEEROM",
            "What is SRAM",
            "What is DRAM",
            "What is North and South Bridge in motherboard and what is difference between them.",
            "What is PCI Slot? What is its use.",
            "What is AGP Slot? What is it used for.",
            "What is BUS?",
            "What are the types of BUS?",
            "What is Von-neumen architecture?",
            "What is Harvard Architecture?",
            "What is ADAS?",
            "What is MICR?",
            "What is OMR?"
          ]
        }
      }
    },
    "reasoning": {
      "name": "Reasoning",
      "icon": "🧠",
      "color": "#a55eea",
      "topics": {}
    },
    "mathematics": {
      "name": "Mathematics",
      "icon": "🧮",
      "color": "#10ac84",
      "topics": {}
    },
    "labourLaws": {
      "name": "Labour Laws, Industrial Relations and Social Security",
      "icon": "⚖️",
      "color": "#ee5253",
      "topics": {}
    },
    "science": {
      "name": "Science",
      "icon": "🔬",
      "color": "#66bb6a",
      "topics": {}
    }
  }
}
